hey @BrianKopp I've took your setup, but I'm running on latest release

```
$ terraform apply 

data.twingate_groups.everyone: Reading...
data.twingate_groups.everyone: Read complete after 0s [id=groups-by-name-Everyone]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # twingate_connector.test_a will be created
  + resource "twingate_connector" "test_a" {
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + name                   = "burrowing-shellfish"
      + private_ips            = (known after apply)
      + public_ip              = (known after apply)
      + remote_network_id      = (known after apply)
      + state                  = (known after apply)
      + status_updates_enabled = (known after apply)
      + version                = (known after apply)
    }

  # twingate_connector.test_b will be created
  + resource "twingate_connector" "test_b" {
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + name                   = "gifted-spaniel"
      + private_ips            = (known after apply)
      + public_ip              = (known after apply)
      + remote_network_id      = (known after apply)
      + state                  = (known after apply)
      + status_updates_enabled = (known after apply)
      + version                = (known after apply)
    }

  # twingate_group.test will be created
  + resource "twingate_group" "test" {
      + id                 = (known after apply)
      + is_authoritative   = (known after apply)
      + name               = "Test"
      + security_policy_id = (known after apply)
    }

  # twingate_remote_network.test will be created
  + resource "twingate_remote_network" "test" {
      + id       = (known after apply)
      + location = "ON_PREMISE"
      + name     = "Test Network"
      + type     = "REGULAR"
    }

  # twingate_resource.test will be created
  + resource "twingate_resource" "test" {
      + address                     = "*.briankopp.com"
      + approval_mode               = (known after apply)
      + id                          = (known after apply)
      + is_active                   = true
      + is_authoritative            = true
      + is_browser_shortcut_enabled = false
      + is_visible                  = true
      + name                        = "Test Resource"
      + protocols                   = {
          + allow_icmp = true
          + tcp        = {
              + policy = "ALLOW_ALL"
              + ports  = []
            }
          + udp        = {
              + policy = "ALLOW_ALL"
              + ports  = []
            }
        }
      + remote_network_id           = (known after apply)

      + access_group {
          + approval_mode = "MANUAL"
          + group_id      = "R3JvdXA6ODc1NTQ2"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

twingate_remote_network.test: Creating...
twingate_group.test: Creating...
twingate_remote_network.test: Creation complete after 1s [id=UmVtb3RlTmV0d29yazo1MjUwODA0]
twingate_connector.test_b: Creating...
twingate_connector.test_a: Creating...
twingate_resource.test: Creating...
twingate_group.test: Creation complete after 1s [id=R3JvdXA6Mzk4MzU2Ng==]        <--- here is ID of the Test group
twingate_connector.test_b: Creation complete after 1s [id=Q29ubmVjdG9yOjEyMjE4NTU=]
twingate_connector.test_a: Creation complete after 1s [id=Q29ubmVjdG9yOjEyMjE4NTY=]
twingate_resource.test: Creation complete after 2s [id=UmVzb3VyY2U6NDI0NDc0OQ==]

```

then I'm adding access for the Test group from UI, and run again terraform apply

```
$  terraform apply

twingate_group.test: Refreshing state... [id=R3JvdXA6Mzk4MzU2Ng==]
twingate_remote_network.test: Refreshing state... [id=UmVtb3RlTmV0d29yazo1MjUwODA0]
data.twingate_groups.everyone: Reading...
data.twingate_groups.everyone: Read complete after 0s [id=groups-by-name-Everyone]
twingate_connector.test_a: Refreshing state... [id=Q29ubmVjdG9yOjEyMjE4NTY=]
twingate_connector.test_b: Refreshing state... [id=Q29ubmVjdG9yOjEyMjE4NTU=]
twingate_resource.test: Refreshing state... [id=UmVzb3VyY2U6NDI0NDc0OQ==]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # twingate_resource.test will be updated in-place
  ~ resource "twingate_resource" "test" {
        id                          = "UmVzb3VyY2U6NDI0NDc0OQ=="
        name                        = "Test Resource"
        # (8 unchanged attributes hidden)

      - access_group {
          - approval_mode = "MANUAL" -> null
          - group_id      = "R3JvdXA6Mzk4MzU2Ng==" -> null     <--- ID of the Test group
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: 

```

could you double check on your side?